
//Плохой стиль

/*function pow(x,n) //Отсутсвует пробел между аргументами. Фигурная скобка с новой строки
{                   
    //логически не разделены блоки функции
    let result=1; //нет отступов
    for(let i=0;i<n;i++) {result*=x;} //нет пробелов. Содержимое {} лучше вывести в новую строку
    return result;
}

let x=prompt("x?",''), n=prompt("n?",'') //В одну строку. Нет пробелов и точки с запятой
if(n<=0) //нет пробелов. Скобка с новой строки
{
    alert(`Степень ${n} не поддерживается введите целую степень, большую 0`);
}
else
{
    alert(pow(x,n))//нет пробелов и точки с запятой
}*/


//Исправленный вариант

function pow(x, n) {                   
    let result = 1;

    for(let i = 0; i < n ; i++) {
        result *= x;
    }

    return result;
}

let x = prompt("x?", ''); 
let n = prompt("n?", '');

if(n <= 0) {
    alert(`Степень ${n} не поддерживается введите целую степень, большую 0`);
} else {
    alert(pow(x,n));
}