//Задание 1

let i = 3;

while (i) {
  alert( i-- );
}
/*
    первая итерация выведет 3
    вторая итерация выведет 2
    третья итерация выведет 1
    в процессе третьей итерации i = 1 - 1 = 0
    цикл заканчивается на 3 итерации
*/

//задание 2
i = 0;
while (++i < 5) alert( i );//вывод цифр от 1 до 4
i = 0;
while (i++ < 5) alert( i );//вывод цифр от 1 до 5

/*оба цикла выведут одинаковые значения,
кроме последнего цикла, последний цикл дополнительно выведет цифру 5
*/ 

//Задание 3
for (i = 0; i < 5; i++) alert( i );
for (i = 0; i < 5; ++i) alert( i );
//Оба цикла выведут цифры от 0 до 4

//Задание 4
for(i = 2; i <= 10; i += 2){
    alert(i);
}

//Задание 5
//for (let i = 0; i < 3; i++) {
//    alert( `number ${i}!` );
// }

i = 0;
while(i < 3){
    alert(`number ${i}!`);
    i++;
}

//Задание 6
let num = 0;
do{
    num = prompt("Enter num > 100: ", 0);
}while(num < 100 && num);

//Задание 7
//7 задание
let numCount = 10;


primeNum:
for(let i = 2; i <= numCount; i++){
    for(let j = i; j < i; j++){
        if(i % j == 0) continue primeNum;
    }
    alert(`${i} простое число.`);
}

